{
    "module": "keras",
    "class_name": "Sequential",
    "config": {
        "name": "sequential_1",
        "trainable": true,
        "dtype": "float32",
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        288
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_1"
                },
                "registered_name": null
            },
            {
                "module": "keras.layers",
                "class_name": "Embedding",
                "config": {
                    "name": "embedding_1",
                    "trainable": true,
                    "dtype": "float32",
                    "input_dim": 15511,
                    "output_dim": 80,
                    "embeddings_initializer": {
                        "module": "keras.initializers",
                        "class_name": "RandomUniform",
                        "config": {
                            "minval": -0.05,
                            "maxval": 0.05,
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        288
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Bidirectional",
                "config": {
                    "name": "bidirectional_1",
                    "trainable": true,
                    "dtype": "float32",
                    "merge_mode": "concat",
                    "layer": {
                        "module": "keras.layers",
                        "class_name": "LSTM",
                        "config": {
                            "name": "forward_lstm_1",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 100,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "OrthogonalInitializer",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        },
                        "registered_name": null,
                        "build_config": {
                            "input_shape": [
                                null,
                                288,
                                80
                            ]
                        }
                    },
                    "backward_layer": {
                        "module": "keras.layers",
                        "class_name": "LSTM",
                        "config": {
                            "name": "backward_lstm_1",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": true,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 100,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "OrthogonalInitializer",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        },
                        "registered_name": null,
                        "build_config": {
                            "input_shape": [
                                null,
                                288,
                                80
                            ]
                        }
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        288,
                        80
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        200
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 15511,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        200
                    ]
                }
            }
        ],
        "build_input_shape": [
            null,
            288
        ]
    },
    "registered_name": null,
    "build_config": {
        "input_shape": [
            null,
            288
        ]
    },
    "compile_config": {
        "optimizer": {
            "module": "keras.optimizers",
            "class_name": "Adam",
            "config": {
                "name": "adam",
                "learning_rate": 0.009999999776482582,
                "weight_decay": null,
                "clipnorm": null,
                "global_clipnorm": null,
                "clipvalue": null,
                "use_ema": false,
                "ema_momentum": 0.99,
                "ema_overwrite_frequency": null,
                "loss_scale_factor": null,
                "gradient_accumulation_steps": null,
                "beta_1": 0.9,
                "beta_2": 0.999,
                "epsilon": 1e-07,
                "amsgrad": false
            },
            "registered_name": null
        },
        "loss": "categorical_crossentropy",
        "loss_weights": null,
        "metrics": [
            "accuracy",
            {
                "module": "builtins",
                "class_name": "function",
                "config": "top_3_accuracy",
                "registered_name": "function"
            },
            {
                "module": "builtins",
                "class_name": "function",
                "config": "top_5_accuracy",
                "registered_name": "function"
            },
            {
                "module": "builtins",
                "class_name": "function",
                "config": "perplexity",
                "registered_name": "function"
            }
        ],
        "weighted_metrics": null,
        "run_eagerly": false,
        "steps_per_execution": 1,
        "jit_compile": false
    }
}